package msg

const (
	H7000 = "H7000 Ошибка: 405, метод не поддерживается. "
	H7001 = "H7001 Ошибка: 500, сервер не отвечает. "
	H7002 = "H7002 Ошибка: не удалось найти шаблон. "
	H7003 = "H7003 Ошибка: нарушение структуры шаблона. "
	H7004 = "H7004 Ошибка: 400, неправильный запрос. "
	H7005 = "H7005 Ошибка: 401, не авторизован. "
	H7006 = "H7006 Ошибка: не удалось записать JSON в поток. "
	H7007 = "H7007 Ошибка: не удалось обработать форму шаблона. "
	H7008 = "H7008 Ошибка: 404, не найден. "
	H7009 = "H7009 Ошибка: 204, нет контента."
	H7010 = "H7010 Ошибка: Сессия истекла."
	H7011 = "H7011 Ошибка: Требуется аутентификация."
	H7012 = "H7012 Ошибка: Сессия не найдена."
	H7013 = "H7013 Ошибка: Не удалось получить сессию."
	H7014 = "H7014 Ошибка: Роль не определена."
	H7015 = "H7015 Ошибка: Доступ запрещен: не достаточно прав."
	H7016 = "H7016 Ошибка: Ошибка загрузки шаблона."
	H7017 = "H7017 Ошибка: Ошибка рендеринга шаблона."
	H7018 = "H7018 Ошибка: Не удалось разобрать форму."

	// Валидация ошибок
	H7100 = "H7100 Ошибка: Артикул варианта упаковки должен содержать 2 цифры. (1-я цифра № печки, 2-я цифра № линии, остальные 3 цифры сгенерируются)."
	H7101 = "H7101 Ошибка: Не удалось распарсить дату и время."
	H7102 = "H7102 Ошибка: Не удалось найти ид."
	H7103 = "H7103 Ошибка: Не удалось найти объект."
	H7104 = "H7104 Ошибка: Не верный ид объекта."
)
